# Append => Hanya menggabungkan atau menambah baris saja

In [4]:
# Load library
import pandas as pd
from IPython.display import display

# Membuat series data
s1 = pd.Series([1, 2, 3, 4, 5, 6])
s2 = pd.Series(["a", "b", "c", "d", "e", "f"])
s2_append_s1 = s2.append(s1)
display(s2_append_s1)

# Membuat dataframe df1 <-> df2
df1 = pd.DataFrame({"a":[1,2],
                    "b":[3,4]})
df2 = pd.DataFrame({"b":[1,2],
                    "a":[3,4]})
df2_append_df1 = df2.append(df1)
display(df1)
display(df2)
display(df2_append_df1)

0    a
1    b
2    c
3    d
4    e
5    f
0    1
1    2
2    3
3    4
4    5
5    6
dtype: object

   a  b
0  1  3
1  2  4

   b  a
0  1  3
1  2  4

   b  a
0  1  3
1  2  4
0  3  1
1  4  2

# Concat => Menggabungkan & Menambah dalam arah Row-wise atau Column-wise

In [10]:
# Load library
import pandas as pd
from IPython.display import display

# Membuat dataframe
df1 = pd.DataFrame({"a" : [1, 2],
                    "b" : [3, 4]})
df2 = pd.DataFrame({"b" : [1, 2],
                    "a" : [3, 4]})

# Menggabungan concat row-wise
print("Concat Row-Wise")
row_wise_concat = pd.concat([df2, df1])
display(row_wise_concat)

# Menggabungkan concat column-wise
print("Concat Column-Wise")
column_wise_concat = pd.concat([df2, df1], axis=1)
display(column_wise_concat)

# Penambahan identifier --> membentuk hasil penggabungan multiindex
print("Multiindex - concat : ")
multiindex_concat = pd.concat([df2, df1], axis=0, keys=["df2", "df1"])
display(multiindex_concat)

Concat Row-Wise

   b  a
0  1  3
1  2  4
0  3  1
1  4  2

Concat Column-Wise

   b  a  a  b
0  1  3  1  3
1  2  4  2  4

Multiindex - concat :

       b  a
df2 0  1  3
    1  2  4
df1 0  3  1
    1  4  2

# Merge

In [10]:
# Load library
import pandas as pd

# Buat dataframe df1 & df2
df1 = pd.DataFrame({
    "key" : ["k1","k2","k3","k4","k5"],
    "val1" : [200, 500, 0, 500, 100],
    "val2" : [30, 50, 100, 20, 10]
})
df2 = pd.DataFrame({
    "key" : ["k1", "k3", "k4", "k7", "k10"],
    "val3" : [1, 2, 3, 4, 5],
    "val4" :[6, 7, 8, 9, 10]
})

# merge yang ekivalen dengan SQL left join
merge_df_left = pd.merge(left=df1, right=df2, how="left", left_on="key", right_on="key")
print("Merge - Left")
display(merge_df_left)
# merge yang ekivalen dengan SQL right join
merge_df_right = pd.merge(left=df1, right=df2, how="right", right_on="key", left_on="key")
print("Merge - right")
display(merge_df_right)
# merge yang ekivalen dengan SQL inner join
merge_df_inner = pd.merge(left=df1, right=df2, how="inner", right_on="key", left_on="key")
print("Merge - inner")
display(merge_df_inner)
# merge yang ekivalen dengan SQL outer join
merge_df_inner = pd.merge(left=df1, right=df2, how="outer", right_on="key", left_on="key")
print("Merge - outer")
display(merge_df_inner)

Merge - Left

  key  val1  val2  val3  val4
0  k1   200    30   1.0   6.0
1  k2   500    50   NaN   NaN
2  k3     0   100   2.0   7.0
3  k4   500    20   3.0   8.0
4  k5   100    10   NaN   NaN

Merge - right

   key   val1   val2  val3  val4
0   k1  200.0   30.0     1     6
1   k3    0.0  100.0     2     7
2   k4  500.0   20.0     3     8
3   k7    NaN    NaN     4     9
4  k10    NaN    NaN     5    10

Merge - inner

  key  val1  val2  val3  val4
0  k1   200    30     1     6
1  k3     0   100     2     7
2  k4   500    20     3     8

Merge - outer

   key   val1   val2  val3  val4
0   k1  200.0   30.0   1.0   6.0
1   k2  500.0   50.0   NaN   NaN
2   k3    0.0  100.0   2.0   7.0
3   k4  500.0   20.0   3.0   8.0
4   k5  100.0   10.0   NaN   NaN
5   k7    NaN    NaN   4.0   9.0
6  k10    NaN    NaN   5.0  10.0